app/views/events/index.html.erb

      <td><%= event.state%></td>
      <td><%= event.user.first_name%></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

        <% else %>
          <% if Attendee.exists?(event_id: event.id, user_id: session[:id])%>
---
SELECT  1 AS one FROM "attendees" WHERE "attendees"."event_id" = ? AND "attendees"."user_id" = ? LIMIT ?  [["event_id", 1], ["user_id", 3], ["LIMIT", 1]]
SELECT "attendees".* FROM "attendees" WHERE "attendees"."event_id" = ?  [["event_id", 1]]