app/views/events/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "attendees".* FROM "attendees" WHERE "attendees"."event_id" = ?  [["event_id", 1]]
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."event_id" = ?  [["event_id", 1]]
---

<p><%= @event.user.first_name%> <%= @event.user.last_name%></p>
<p><%= @event.city %> <%= @event.state %></p>
<p>People who are joining the event: <%= @event.attendees.count%></p>

SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 1]]
---
<h4>Discussion about <%= @event.name%>: </h4>
<% @event.comments.each do |comment| %>