app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "event_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "1st comment"], ["event_id", 1], ["user_id", 3], ["created_at", 2017-03-21 21:40:25 UTC], ["updated_at", 2017-03-21 21:40:25 UTC]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def create
    comment = Comment.create(content: params[:content], user: User.find(params[:user_id]), event: Event.find(params[:event_id]))