app/controllers/events_controller.rb

  def index
    @in_state_events = Event.where(state: session[:state])
---
SELECT "events".* FROM "events" WHERE ("events"."state" != ?)  [["state", "IL"]]

  def create
    event = Event.create(name: params[:name], date: params[:date], city: params[:city], state: params[:state], user: User.find(session[:id]))
---
INSERT INTO "events" ("name", "date", "city", "state", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "1st event"], ["date", 2015-11-30 00:00:00 UTC], ["city", "Chicago"], ["state", "IL"], ["user_id", 1], ["created_at", 2017-03-21 18:17:03 UTC], ["updated_at", 2017-03-21 18:17:03 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    event = Event.find(params[:id])
    event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 3]]

  def update
    event = Event.find(params[:id])
    puts params[:date]
    event.name = params[:name]
    event.date = params[:date]
    event.city = params[:city]
    event.state = params[:state]
    event.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "events" SET "name" = ?, "date" = ?, "city" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "changes"], ["date", 2017-10-30 00:00:00 UTC], ["city", "sdfkj"], ["updated_at", 2017-03-22 16:37:22 UTC], ["id", 4]]

  def join
    join = Attendee.create(event: Event.find(params[:event_id]), user: User.find(params[:user_id]))
---
INSERT INTO "attendees" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["event_id", 2], ["created_at", 2017-03-21 19:24:24 UTC], ["updated_at", 2017-03-21 19:24:24 UTC]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def leave
    leave = Attendee.where(event: Event.find(params[:event_id]), user: User.find(params[:user_id]))
    leave.each do |remove|
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "attendees".* FROM "attendees" WHERE "attendees"."event_id" = 2 AND "attendees"."user_id" = 2
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]