app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "city", "state", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "city" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "curtis"], ["last_name", "curtis"], ["city", "curtis"], ["updated_at", 2017-03-22 16:36:31 UTC], ["id", 6]]
---
  def update
    user = User.find(params[:id])
    user.first_name = params[:first_name]
    user.last_name = params[:last_name]
    user.email = params[:email]
    user.city = params[:city]
    user.state = params[:state]
    user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]
---
  def login
    user = User.find_by_email(params[:email]).try(:authenticate, params[:password])